<h3>
    welcome
</h3>
<div class="d-flex flex-column-reverse">
    <section>
        <h4 class="mt-3 mb-2">
            10.07.2024
        </h4>
        <h5>Админ панель</h5>
        <p>
            <b>Корректировка БД с учетом изменений:</b>
            <br>
            &emsp;- удаление источников<br>
            &emsp;- удаление коллекций<br>
            &emsp;- Добавление типов публикаций<br>
            &emsp;- отдельные сущности для<br>
            &emsp;&emsp;- авторов<br>
            &emsp;&emsp;- тегов<br>
            &emsp;&emsp;- руководителей<br>
            &emsp;- Добавление связей публикаций с авторами, тегами и руководителями
        </p>
        <p>
            <b>Обработка типов публикаций</b>
            <br>
            &emsp;- Вывод списка<br>
            &emsp;- Созданние<br>
            &emsp;- Редактирование<br>
            &emsp;- Удаление<br>
            &emsp;- Смена видимости<br>
        </p>
        <p>
            <b>Добавлена функция перерасчета счетчиков:</b>
            <br>
            &emsp;- разедлов<br>
            &emsp;- авторов<br>
            &emsp;- реководителей<br>
            &emsp;- тегов<br>
            &emsp;- типов публикации<br>
        </p>
        <p>
            <b>Добавлен перерасчет счетчиков при сохранение публикации</b>
        </p>
        <p>
            <b>
                Добавлен перерасчет счетчиков при авторизации в админ панели
            </b>
        </p>
        <p>
            <b>Корректировка БД с учетом изменений:</b>
            <br>
            &emsp;- удаление источников<br>
            &emsp;- удаление коллекций<br>
            &emsp;- отдельные сущности для<br>
            &emsp;&emsp;- авторов<br>
            &emsp;&emsp;- тегов<br>
            &emsp;&emsp;- руководителей<br>
            &emsp;- Добавление связей публикаций с авторами, тегами и руководителями<br>
        </p>
        <h5>Клиентская часть</h5>
        <p>
            <b>Внесены изменения в карточку публикации</b>
            <br>
            &emsp;-Изменен стилистика заголовка<br>
            &emsp;-Изменен стилистика вывода разделов<br>
            &emsp;-Выведен список авторов<br>
            &emsp;-Выведен список тегов<br>
            &emsp;-Выведен руководитель<br>
            &emsp;-Руководитель сделан ссылкой<br>

        </p>
    </section>
    <section>
        <h4 class="mt-3 mb-2">
            11.07.2024
        </h4>
    </section>
</div>