app/Models/CollectionsModel.php

    public function CollectionsAdd($form){

        $sql=[
            "title"=>$form->title,
            "description"=>$form->description,
        ];
        $this->db->table("collections")->insert($sql);
---
INSERT INTO `collections` (`title`, `description`) VALUES ('asd', '123')

    public function getTitleCollection():array{
        $q= $this->db->table("collections")->get();
---
SELECT *
FROM `collections`

    public function getCountCollection():array{
        $q= $this->db->table("collections")->get();
---
SELECT *
FROM `collections`

    public function getDescriptionCollection():array{
        $q= $this->db->table("collections")->get();
---
SELECT *
FROM `collections`

    public function getCollectionsList():array{
        $q= $this->db->table("collections");
        $q= $q->get();
---
SELECT *
FROM `collections`