app/Models/GeneralModel.php

SELECT *
FROM `menu`
WHERE `section` = 'admin'
AND `parent` = 0
AND `display` = '1'
ORDER BY `sort`
---
    public function getMenu($section= "public",$parent= 0){
        $q= $this->db->table("menu")->where(["section"=>$section,"parent"=>$parent,"display"=>'1'])->orderBy("sort")->get();